In [6]:
import pandas as pd
import numpy as np

In [7]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0], [3,4,np.nan, 1],
                  [np.nan, np.nan, np.nan, 5]], columns=list("ABCD"))

In [8]:
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5

In [13]:
df.dropna(axis=1, how='all') 
# axis=1 column, axis=0 row 
# howall은 전부 null일 때 제거 any면 1개만 null이어도 제거

     A    B  D
0  NaN  2.0  0
1  3.0  4.0  1
2  NaN  NaN  5

In [15]:
df.dropna(axis=1, how='any')

   D
0  0
1  1
2  5

In [18]:
df.fillna(0)

     A    B    C  D
0  0.0  2.0  0.0  0
1  3.0  4.0  0.0  1
2  0.0  0.0  0.0  5

In [19]:
values = {'A' : 0,'B' : 1,'C' : 2,'D' : 3}
df.fillna(value=values)

     A    B    C  D
0  0.0  2.0  2.0  0
1  3.0  4.0  2.0  1
2  0.0  1.0  2.0  5

In [20]:
df.fillna(df['D'].mean())

     A    B    C  D
0  2.0  2.0  2.0  0
1  3.0  4.0  2.0  1
2  2.0  2.0  2.0  5

In [21]:
df.isnull().sum()

A    2
B    1
C    3
D    0
dtype: int64